oc_parallel_contrast/src/main/resources/resource/bp-message.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.rm.linkage.com">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:rscService soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <funcCode xsi:type="soapenc:string" xs:type="type:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xs="http://www.w3.org/2000/XMLSchema-instance">irmResConfRequest</funcCode>
            <header xsi:type="soapenc:string" xs:type="type:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xs="http://www.w3.org/2000/XMLSchema-instance"></header>
            <body xsi:type="soapenc:string" xs:type="type:string" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xs="http://www.w3.org/2000/XMLSchema-instance">
                <![CDATA[
		<?xml version="1.0" encoding="UTF-8"?>
		<root>
		  <expInfo>
		    <orderItem>
		      <itemSpecId>10001</itemSpecId>
		      <desc>产品实例ID</desc>
		      <seq>1</seq>
		      <newItemVal>600003635901</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10002</itemSpecId>
		      <desc>产品ID</desc>
		      <seq>1</seq>
		      <newItemVal>6600117000</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10045</itemSpecId>
		      <desc>服务编码</desc>
		      <seq>1</seq>
		      <newItemVal>1F006</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300041</itemSpecId>
		      <desc>营业备注</desc>
		      <seq>1</seq>
		      <newItemVal>有线宽带 - 新装</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10082</itemSpecId>
		      <desc>地区ID</desc>
		      <seq>1</seq>
		      <newItemVal>8530103</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>30005</itemSpecId>
		      <desc>局向ID</desc>
		      <seq>1</seq>
		      <newItemVal>101125282</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10022</itemSpecId>
		      <desc>联系人</desc>
		      <seq>1</seq>
		      <newItemVal>孙浩俊</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10023</itemSpecId>
		      <desc>联系电话</desc>
		      <seq>1</seq>
		      <newItemVal>13398805524</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300054</itemSpecId>
		      <desc>用户名称</desc>
		      <seq>1</seq>
		      <newItemVal>孙浩俊</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10042</itemSpecId>
		      <desc>标准地址ID</desc>
		      <seq>1</seq>
		      <newItemVal>28244148</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300084</itemSpecId>
		      <desc>同址电话标识</desc>
		      <seq>1</seq>
		      <newItemVal>999</newItemVal>
		      <oldItemVal>999</oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300039</itemSpecId>
		      <desc>是否混合放号</desc>
		      <seq>1</seq>
		      <newItemVal>0</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300037</itemSpecId>
		      <desc>昆明支撑操作点</desc>
		      <seq>1</seq>
		      <newItemVal>71037</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300055</itemSpecId>
		      <desc>是否必须多PVC端口</desc>
		      <seq>1</seq>
		      <newItemVal>0</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300109</itemSpecId>
		      <desc>服务开通定单标识</desc>
		      <seq>1</seq>
		      <newItemVal>8712201041001415585lpy04</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10092</itemSpecId>
		      <desc>付费方式</desc>
		      <seq>1</seq>
		      <newItemVal>1201</newItemVal>
		      <oldItemVal>1201</oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300068</itemSpecId>
		      <desc>定单主题</desc>
		      <seq>1</seq>
		      <newItemVal>有线宽带 - 新装</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300061</itemSpecId>
		      <desc>受理操作点</desc>
		      <seq>1</seq>
		      <newItemVal>600140</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10139</itemSpecId>
		      <desc>新接入号码</desc>
		      <seq>1</seq>
		      <newItemVal>A00000450528</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10141</itemSpecId>
		      <desc>旧接入号码</desc>
		      <seq>1</seq>
		      <newItemVal>A00000450528</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10620</itemSpecId>
		      <desc>计费号码</desc>
		      <seq>1</seq>
		      <newItemVal>A00000450528</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300097</itemSpecId>
		      <desc>客户ID</desc>
		      <seq>1</seq>
		      <newItemVal>712838086</newItemVal>
		      <oldItemVal>712838086</oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10035</itemSpecId>
		      <desc>客户名称</desc>
		      <seq>1</seq>
		      <newItemVal>孙浩俊</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10043</itemSpecId>
		      <desc>客户类型名称</desc>
		      <seq>1</seq>
		      <newItemVal>政企客户</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10397</itemSpecId>
		      <desc>客户级别</desc>
		      <seq>1</seq>
		      <newItemVal>普通</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300062</itemSpecId>
		      <desc>受理员工</desc>
		      <seq>1</seq>
		      <newItemVal>苏晓花</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10020</itemSpecId>
		      <desc>装机地址</desc>
		      <seq>1</seq>
		      <newItemVal>云南省昆明市盘龙区拓东街道东风东路东风东路商铺1栋商铺1层149</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10146</itemSpecId>
		      <desc>预约装机时间</desc>
		      <seq>1</seq>
		      <newItemVal>2021-09-28 12:00</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300037</itemSpecId>
		      <desc>默认操作点</desc>
		      <seq>1</seq>
		      <newItemVal>048</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>10466</itemSpecId>
		      <desc>客户地址</desc>
		      <seq>1</seq>
		      <newItemVal>云南省曲靖市富源县墨红镇世迤村委会贾马黑村106号(证件地址)</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>827907377</itemSpecId>
		      <desc>回单环境标识</desc>
		      <seq>1</seq>
		      <newItemVal>D</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300110</itemSpecId>
		      <desc>传输/数据速率</desc>
		      <seq>1</seq>
		      <newItemVal>100</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300040</itemSpecId>
		      <desc>宽带帐号</desc>
		      <seq>1</seq>
		      <newItemVal>a000001051626</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300080</itemSpecId>
		      <desc>用户账号上行速率</desc>
		      <seq>1</seq>
		      <newItemVal>20</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300081</itemSpecId>
		      <desc>用户账号下行速率</desc>
		      <seq>1</seq>
		      <newItemVal>100</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300082</itemSpecId>
		      <desc>用户端口上行速率</desc>
		      <seq>1</seq>
		      <newItemVal>20</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300083</itemSpecId>
		      <desc>用户端口下行速率</desc>
		      <seq>1</seq>
		      <newItemVal>100</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300135</itemSpecId>
		      <desc>现堪资源</desc>
		      <seq>1</seq>
		      <newItemVal>现堪资源</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300065</itemSpecId>
		      <desc>同笔定单号</desc>
		      <seq>1</seq>
		      <newItemVal>60000644323lpy04</newItemVal>
		      <oldItemVal></oldItemVal>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300051</itemSpecId>
		      <desc>工单到达时间</desc>
		      <seq>1</seq>
		      <newItemVal>2022-01-18 09:54:30</newItemVal>
		      <oldItemVal/>
		    </orderItem>
		    <orderItem>
		      <itemSpecId>300129</itemSpecId>
		      <desc>定单经过环节</desc>
		      <seq>1</seq>
		      <newItemVal>获</newItemVal>
		      <oldItemVal/>
		    </orderItem>
		  </expInfo>
		  <baseInfo>
		    <orderId>8712201041001415585lpy04</orderId>
		    <workOrderId>2016583993</workOrderId>
		    <actionNo>获</actionNo>
		    <assignType>获</assignType>
		    <seq/>
		    <productId>6600117000</productId>
		    <accessNumber>A00000450528</accessNumber>
		    <accessType>1</accessType>
		    <InstallFlag>0</InstallFlag>
		    <inteOrderDispSeq>1</inteOrderDispSeq>
		    <orgId/>
		    <dispStaffId/>
		    <stateDate>2022-01-18 09:54:30</stateDate>
		    <returnId/>
		    <displDate/>
		    <complDate/>
		    <handingStaffId/>
		    <orderFlag/>
		    <remarks/>
		    <areaId>8530103</areaId>
		  </baseInfo>
		</root>
	]]>
            </body>
        </ser:rscService>
    </soapenv:Body>
</soapenv:Envelope>